src/cf/InformationRegisters/инт_ИсторияСтатусовРассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ИсторияСтатусовРассылкиСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыРассылкиИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Подписчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ИсторияСтатусовРассылкиСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////

// инт_ИсторияСтатусовИсходящихСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Записать статус в историю
//
// Параметры:
//  Подписчик                  -  СправочникСсылка.инт_Подписчики  - Ссылка на подписчика сообщения.
//  ИдентификаторСообщения     -  УникальныйИдентификатор  - Уникальный идентификатор сообщения
//  Статус                     -  ПеречислениеСсылка.инт_СтатусыИсходящихСообщений  -  Статус сообщения.
//  ТекстОшибки                -  Строка    - Текст ошибки при формировании сообщения 
//
Процедура ЗаписатьСтатусВИсторию(ИдентификаторСообщения, Подписчик, СтатусСообщения, ТекстОшибки="") экспорт
    Запись = РегистрыСведений.инт_ИсторияСтатусовРассылкиСообщений.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДатаСеанса();
    Запись.ИдентификаторСообщения = ИдентификаторСообщения;
    Запись.СтатусСообщения = СтатусСообщения;
    Запись.Подписчик = Подписчик;
    Запись.ТекстОшибки = ТекстОшибки;
    Запись.Записать(Истина);
КонецПроцедуры

// Процедура - Очистить историю по идентификатору
// Очищает историю статусов по переданному идентификатору сообщения
// Параметры:
//  ИдентификаторСообщения     -  УникальныйИдентификатор  - Уникальный идентификатор сообщения
//  Подписчик                  -  СправочникСсылка.инт_Подписчики  - Ссылка на подписчика сообщения.
//
Процедура ОчиститьИсториюСообщений(ИдентификаторСообщения, Подписчик = Неопределено) Экспорт
	Набор = РегистрыСведений.инт_ИсторияСтатусовРассылкиСообщений.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Если НЕ Подписчик = Неопределено Тогда
		Набор.Отбор.Подписчик.Установить(Подписчик);
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
